app/controllers/home_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT `comments`.* FROM `comments` WHERE (`comments`.pin_item_id IN (2,1))
SELECT * FROM `pin_items` ORDER BY created_at desc
---
  def index
    user_id = params[:user_id]
    query = ((user_id.to_i > 0) ? "user_id = #{user_id}" : nil)

    @pin_images = PinItem.find(:all,:conditions => ["#{query}"],:include => [:comments, :user],:order => "created_at desc")
    if current_user
      redirect_to addpin_path and return if @pin_images.empty?

SELECT * FROM `user_points` WHERE (`user_points`.user_id = 1)
SELECT * FROM `users`
---
  def winners
    @users = User.all.sort! { |u1, u2| u2.points <=> u1.points}