app/controllers/pin_items_controller.rb

INSERT INTO `pin_items` (`created_at`, `image_url`, `updated_at`, `pin_type`, `user_id`, `description`) VALUES('2012-07-11 11:01:10', '1341553219-NewUIHPCocktail_New.jpg', '2012-07-11 11:01:10', 1, 1, 'want cocktail wears ?')
---
  def add_pin_item
    @pin_item = PinItem.new(params[:pin_image])
    @pin_item.image_remote_url = params[:image_url]
    @pin_item.user_id = current_user.id
    @pin_item.save!

SELECT * FROM `pin_items` WHERE (`pin_items`.`id` = 1)
---
  def effects
    @pin_item = PinItem.find(params[:id])

SELECT * FROM `pin_items` WHERE (`pin_items`.`id` = 1)
INSERT INTO `comments` (`comment`, `created_at`, `updated_at`, `user_id`, `pin_item_id`) VALUES('waiting....', '2012-07-12 09:46:11', '2012-07-12 09:46:11', 2, 1)
---
  def comment
    @pin_item = PinItem.find(params[:id])
    comment = params[:comment]
    if comment
      @comment = current_user.comments.new(:pin_item_id => @pin_item.id, :comment => comment.strip)
      if @comment.valid?
        @comment.save

SELECT * FROM `pin_items` WHERE (`pin_items`.`id` = 1)
---
  def show
    @pin_item = PinItem.find(params[:id])

SELECT * FROM `pin_items` WHERE (`pin_items`.`id` = 1)
INSERT INTO `pin_items` (`created_at`, `image_url`, `updated_at`, `pin_type`, `user_id`, `description`) VALUES('2012-07-11 11:04:33', 'implode_1.jpg', '2012-07-11 11:04:33', 3, 1, 'want cocktail wears ?')
INSERT INTO `user_points` (`point_type`, `created_at`, `updated_at`, `points`, `user_id`, `pin_item_id`) VALUES(5, '2012-07-11 11:04:33', '2012-07-11 11:04:33', -10, 1, 1)
SELECT count(*) AS count_all FROM `user_points` WHERE (`user_points`.pin_item_id = 1 AND (point_type = 4))
---
  def set_like
    pin_item = PinItem.find(params[:id])
    # pin_item_id = params[:id]

    user_point = UserPoint.new(:user_id => current_user.id,:pin_item_id => pin_item.id)
    user_point.point_type = UserPoint::POINT_TYPES[:like][:type]
    user_point.points = UserPoint::POINT_TYPES[:like][:points]
    user_point.save
#    flash.now[:notice] = "#{pin_item_id} is liked"

    render :update do |page|
      page.replace_html "pin_item_#{pin_item.id}_likes", pin_item.user_likes.count