app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`email` = 'ankit@dealkat.com') LIMIT 1
INSERT INTO `users` (`name`, `secret_token`, `created_at`, `image_url`, `updated_at`, `uid`, `remember_token`, `email`, `provider`) VALUES(NULL, NULL, '2012-07-12 09:36:27', '/images/default_pic.jpeg', '2012-07-12 09:36:27', NULL, NULL, 'ankit@dealkat.com', NULL)
---
  def login
    if params[:user]
      email = params[:user][:email]
      if email.nil? or email.blank?
        flash[:error] = "Hey, please enter valid email"
        return
      end
      user = User.find_or_create_by_email(email)

SELECT * FROM `users` WHERE (`users`.`provider` = 'facebook' AND `users`.`uid` = '1066634600') LIMIT 1
---
  def create
    auth = request.env["rack.auth"]
#    render :text => auth.inspect and return false
    user = User.find_or_initialize_by_provider_and_uid(auth['provider'], auth['uid'])